import type {THeader} from '../types'

export const lossesTotalHeader: THeader = [
    [
        ['Частина', 2, 1], ['Облікувати', 2, 1], ['Обліковано', 1, 5], ['Списано', 1, 5], ['Списати', 2, 1], ['Різниця з ФЕВ', 1, 2]
    ],
    [
        ['Разом', 1, 1], ['Мин. міс.', 1, 1], ['Пот. міс.', 1, 1], ['Мин. тижд.', 1, 1], ['Пот. тижд.', 1, 1],
        ['Разом', 1, 1], ['Мин. міс.', 1, 1], ['Пот. міс.', 1, 1], ['Мин. тижд.', 1, 1], ['Пот. тижд.', 1, 1],
        ['Облік', 1, 1], ['Списання.', 1, 1],
    ]
]

export const moneyTotalHeader: THeader = [
    [
        ['Частина', 2, 1], ['КЕКВ', 2, 1], ['Код', 2, 1], ['Загальний фонд', 1, 7], ['ПДФО', 1, 7], ['Субвенції', 1, 6]
    ],
    [
        ['Кошторис', 1, 1], ['Фінанс.', 1, 1], ['Зобов.', 1, 1], ['%',1,1], ['Залишок', 1, 1], ['Витрати', 1, 1], ['На рах.', 1, 1],
        ['Кошторис', 1, 1], ['Фінанс.', 1, 1], ['Зобов.', 1, 1], ['%',1,1], ['Залишок', 1, 1], ['Витрати', 1, 1], ['На рах.', 1, 1],
        ['Виділено', 1, 1], ['Зобов.', 1, 1], ['%',1,1], ['Залишок', 1, 1], ['Витрати', 1, 1], ['На рах.', 1, 1],
    ]
]